# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие
# лекционных, практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого
# предмета не обязательно были все типы занятий. Сформировать словарь, содержащий название предмета и общее
# количество занятий по нему. Вывести словарь на экран. Примеры строк файла: Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб) Физкультура: — 30(пр) —

# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

# на вход даем строки файла:
# Информатика: 100 50 20
# Физика: 30 0 10
# Физкультура: 0 30 0

# добавила encoding='utf-8-sig', потому что иначе ответ выдавался с \ufeff

subj = {}
with open('/home/alina/PycharmProjects/school.txt', 'r', encoding='utf-8-sig') as init_f:
    for line in init_f:
        subject, lecture, practice, lab = line.split()
        subj[subject] = int(lecture) + int(practice) + int(lab)
    print(subj)

# на выходе получаем : {'Информатика:': 170, 'Физика:': 40, 'Физкультура:': 30}
