# Узнайте у пользователя число n.
# Найдите сумму чисел n + nn + nnn.

num = input("Enter the number: ")

answer = int(num) + int(num * 2) + int(num * 3)

print(answer)
