# Создайте несколько переменных, выведите на экран

var1 = 42
print(var1)

var2 = 6 * 7
print(var2)

var3 = var1 == var2
print(var3)

# Запросите у пользователя несколько чисел и строк, сохраните в переменные, выведите на экран

country = input("Enter your country: ")
cats = input("Do you like cats?: ")
print(country, cats)

birth = int(input("Enter your year of birth: "))
year = int(input("What is the year now?: "))
print(birth, year)
